print('''
              ________  ___  ________  ________  ___  __    ___       ___  ___  __                                  
             |\   ____\|\  \|\   ____\|\   __  \|\  \|\  \ |\  \     |\  \|\  \|\  \                                
             \ \  \___|\ \  \ \  \___|\ \  \|\  \ \  \/  /|\ \  \    \ \  \ \  \/  /|_                              
              \ \_____  \ \  \ \  \    \ \   __  \ \   ___  \ \  \    \ \  \ \   ___  \                             
               \|____|\  \ \  \ \  \____\ \  \ \  \ \  \\ \  \ \  \____\ \  \ \  \\ \  \                            
                 ____\_\  \ \__\ \_______\ \__\ \__\ \__\\ \__\ \_______\ \__\ \__\\ \__\                           
                |\_________\|__|\|_______|\|__|\|__|\|__| \|__|\|_______|\|__|\|__| \|__|                           
 ________  __________________   ___  ___  ________  _________  ___  ___  ________  ___  ___  ________  ___  ___     
|\   ___ \|\   __  \|\   ___  \|\  \|\  \|\   ____\|\___   ___\\  \|\  \|\   __  \|\  \|\  \|\   ____\|\  \|\  \    
\ \  \_|\ \ \  \|\  \ \  \\ \  \ \  \\\  \ \  \___|\|___ \  \_\ \  \\\  \ \  \|\  \ \  \\\  \ \  \___|\ \  \\\  \   
 \ \  \ \\ \ \  \\\  \ \  \\ \  \ \  \\\  \ \_____  \   \ \  \ \ \  \\\  \ \   _  _\ \  \\\  \ \  \    \ \  \\\  \  
  \ \  \_\\ \ \  \\\  \ \  \\ \  \ \  \\\  \|____|\  \   \ \  \ \ \  \\\  \ \  \\  \\ \  \\\  \ \  \____\ \  \\\  \ 
   \ \_______\ \_______\ \__\\ \__\ \_______\____\_\  \   \ \__\ \ \_______\ \__\\ _\\ \_______\ \_______\ \_______\
    \|_______|\|_______|\|__| \|__|\|_______|\_________\   \|__|  \|_______|\|__|\|__|\|_______|\|_______|\|_______|
                                            \|_________|                                                            
                                                                                                                    
                                                                                                                    
''')

def sicaklik_donusturucu():
    secim = input("Fahrenheit'dan Celsius'a dönüştürmek için 'F' veya Celsius'tan Fahrenheit'a dönüştürmek için 'C' girin: ")

    if secim.upper() == 'F':
        fahrenheit = float(input("Dönüştürmek istediğiniz Fahrenheit değerini girin: "))
        celsius = (fahrenheit - 32) * 5/9
        print(f"{fahrenheit} Fahrenheit, {celsius:.2f} Celsius'a eşittir.")
    elif secim.upper() == 'C':
        celsius = float(input("Dönüştürmek istediğiniz Celsius değerini girin: "))
        fahrenheit = (celsius * 9/5) + 32
        print(f"{celsius} Celsius, {fahrenheit:.2f} Fahrenheit'a eşittir.")
    else:
        print("Geçersiz bir seçim yaptınız.")

sicaklik_donusturucu()